### _Section 17.0:_ Load packages

In [1]:
import pandas as pd
from pandas.io import sql
import sqlite3

### _Section 17.1:_ Load databases

Pandas can be used to connect to most relational databases. In this demonstration, we will create and connect to a SQLite database. SQLite creates portable SQL databases saved in a single file. These databases are stored in a very efficient manner and allow fast querying, making them ideal for small databases or databases that need to be moved across machines.

If you are looking to start using a database without the setup of `mysql` or `postgres`, SQLite is a good start.

In [2]:
conn = sqlite3.connect('./datasets/dat-test.db')

Let's return to the Rossmann sales data and load that into the database.

Data is moved to the database through the `to_sql` command, similar to the `to_csv` command.

`to_sql` takes as arugments:
    - `name`, the table name to create
    - `con`, a connection to a database
    - `index`, whether to input the index column
    - `schema`, if we want to write a custom schema for the new table
    - `if_exists`, what to do if the table already exists. We can overwrite it, add to it, or fail

In [3]:
# Load Rossman data
rossmann_data = pd.read_csv('../../lesson-15/code/datasets/rossmann.csv', low_memory=False)

# Load Rossman meta-data
rossmann_stores = pd.read_csv('./datasets/rossmann-stores.csv')

In [4]:
# Feed Rossman data into sql database
rossmann_data.to_sql('rossmann_sales',
            con=conn,
            if_exists='replace',
            index=False)

In [5]:
# Issue SQL test-commands
sql.read_sql(
    """
    SELECT * 
    FROM rossmann_sales 
    LIMIT 10;
    """, con=conn)

,Store,DayOfWeek,Date,Sales,Customers,Open,Promo,StateHoliday,SchoolHoliday
0,1,5,2015-07-31,5263,555,1,1,0,1
1,2,5,2015-07-31,6064,625,1,1,0,1
2,3,5,2015-07-31,8314,821,1,1,0,1
3,4,5,2015-07-31,13995,1498,1,1,0,1
4,5,5,2015-07-31,4822,559,1,1,0,1
5,6,5,2015-07-31,5651,589,1,1,0,1
6,7,5,2015-07-31,15344,1414,1,1,0,1
7,8,5,2015-07-31,8492,833,1,1,0,1
8,9,5,2015-07-31,8565,687,1,1,0,1
9,10,5,2015-07-31,7185,681,1,1,0,1

### _17.2:_ Table creation
Create a table into the database from the Rossmann Store metadata

In [6]:
# TODO

### _17.3:_ SELECT
Write a query that returns the `Store`, `Date` and `Customers`

In [7]:
# TODO

   Store        Date  Customers
0      1  2015-07-31        555
1      2  2015-07-31        625
2      3  2015-07-31        821
3      4  2015-07-31       1498
4      5  2015-07-31        559

### _17.4:_ WHERE
Write a query that returns the `Store`, `Date` and `Customers` for when the stores were open and running a promotion

In [8]:
# TODO

   Store        Date  Customers
0      1  2015-07-31        555
1      2  2015-07-31        625
2      3  2015-07-31        821
3      4  2015-07-31       1498
4      5  2015-07-31        559

### _17.5:_ GROUP BY
Write a query that returns the total sales on promotion days ('Promo')

In [9]:
# TODO

   Promo  Store  SUM(Sales)
0      0   1115  2771974337
1      1   1115  3101206286

## Walmart store data

In [ ]:
# TODO

### _17.6:_ Exercises

1. Create a table for each of those datasets
1. Select the store, date and fuel price on days it was over 90 degrees
1. Select the store, date and weekly sales and temperature
1. What were average sales on holiday vs. non-holiday sales
1. What were average sales on holiday vs. non-holiday sales when the temperature was below 32 degrees

In [ ]:
# TODO